#Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
bukvi=('abcdefghijklmnopqrstuvwxyz')
a=int(input('Введите порядковы номер буквы: '))
print(bukvi[a-1])
