# 1. Проанализировать количество памяти в 3 вариантах решений 1 задачи.
# Определить является ли введенный год високосным или нет


import sys
import ctypes
import struct

import calendar

print('Является ли введенный год високосным.')
a = int(input('Введите год в виде YYYY: '))
#
# # 1 вариант
#
# b = ()
# def calend():
#     if calendar.isleap(a):
#         b = 'Введенный год високосный'
#     else:
#         b = 'Введенный год не високосный'
#     print(b)
#
#     print(f'Ячейка памяти: {id(b)}')
#     print(f'Размер памяти: {sys.getsizeof(b)}')
#     print(ctypes.string_at(id(b), sys.getsizeof(b)))
#     print(struct.unpack('LLLLLLLLllliic' + 'c' * 25, ctypes.string_at(id(b), sys.getsizeof(b))))
#
# calend()


# Ячейка памяти: 140557851056048
# Размер памяти: 122
# b'\x03\x00\x00\x00\x00\x00\x00\x00@E\x9d\x00\x00\x00\x00\x00\x18\x00\x00\x00\x00\x00\x00\x00]$\xb9\x0e\x12\x17q\x01\xa8\x81\xd1\x82\xd0\xbe\xd0\xbb\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x12\x042\x045\x044\x045\x04=\x04=\x04K\x049\x04 \x003\x04>\x044\x04 \x002\x048\x04A\x04>\x04:\x04>\x04A\x04=\x04K\x049\x04\x00\x00'
# (3, 10306880, 24, 103889632730096733, 13533526683005583784, 0, 0, 0, 0, 302871700690830354, 309345659515634741, 2098233, 71173171, b'4', b'\x04', b' ', b'\x00', b'2', b'\x04', b'8', b'\x04', b'A', b'\x04', b'>', b'\x04', b':', b'\x04', b'>', b'\x04', b'A', b'\x04', b'=', b'\x04', b'K', b'\x04', b'9', b'\x04', b'\x00', b'\x00')

# 2 вариант


# def calend():
#     if a % 4 != 0:
#         print('Введенный год не високосный')
#     elif a % 100 == 0:
#         if a % 400 == 0:
#             b = 'Введенный год високосный'
#             print(b)
#         else:
#             print('Введенный год не високосный')
#     else:
#         b = 'Введенный год високосный'
#         print(b)
#
#     print(f'Ячейка памяти: {id(b)}')
#     print(f'Размер памяти: {sys.getsizeof(b)}')
#     print(ctypes.string_at(id(b), sys.getsizeof(b)))
#     print(struct.unpack('LLLLLLLLllliic' + 'c' * 25, ctypes.string_at(id(b), sys.getsizeof(b))))
# calend()

# Ячейка памяти: 140445965043632
# Размер памяти: 122
# b'\x03\x00\x00\x00\x00\x00\x00\x00@E\x9d\x00\x00\x00\x00\x00\x18\x00\x00\x00\x00\x00\x00\x00k\x12B\xbb\xff\x95\x9d\xb3\xa8\x81\xd1\x82\xd0\xbe\xd0\xbb\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x12\x042\x045\x044\x045\x04=\x04=\x04K\x049\x04 \x003\x04>\x044\x04 \x002\x048\x04A\x04>\x04:\x04>\x04A\x04=\x04K\x049\x04\x00\x00'
# (3, 10306880, 24, 12942665829723542123, 13533526683005583784, 0, 0, 0, 0, 302871700690830354, 309345659515634741, 2098233, 71173171, b'4', b'\x04', b' ', b'\x00', b'2', b'\x04', b'8', b'\x04', b'A', b'\x04', b'>', b'\x04', b':', b'\x04', b'>', b'\x04', b'A', b'\x04', b'=', b'\x04', b'K', b'\x04', b'9', b'\x04', b'\x00', b'\x00')


# 3 вариант

#
# def calend():
#     if a % 4 != 0 or (a % 100 == 0 and a % 400 != 0):
#         print('Введенный год не високосный')
#     else:
#         b = 'Введенный год високосный'
#         print(b)
#
#         print(f'Ячейка памяти: {id(b)}')
#         print(f'Размер памяти: {sys.getsizeof(b)}')
#         print(ctypes.string_at(id(b), sys.getsizeof(b)))
#         print(struct.unpack('LLLLLLLLllliic' + 'c' * 25, ctypes.string_at(id(b), sys.getsizeof(b))))
# calend()


# Ячейка памяти: 140207478446256
# Размер памяти: 122
# b'\x03\x00\x00\x00\x00\x00\x00\x00@E\x9d\x00\x00\x00\x00\x00\x18\x00\x00\x00\x00\x00\x00\x00p\x0f\x11_\x12\xe3\xebn\xa8\x81\xd1\x82\xd0\xbe\xd0\xbb\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x12\x042\x045\x044\x045\x04=\x04=\x04K\x049\x04 \x003\x04>\x044\x04 \x002\x048\x04A\x04>\x04:\x04>\x04A\x04=\x04K\x049\x04\x00\x00'
# (3, 10306880, 24, 7992731631742947184, 13533526683005583784, 0, 0, 0, 0, 302871700690830354, 309345659515634741, 2098233, 71173171, b'4', b'\x04', b' ', b'\x00', b'2', b'\x04', b'8', b'\x04', b'A', b'\x04', b'>', b'\x04', b':', b'\x04', b'>', b'\x04', b'A', b'\x04', b'=', b'\x04', b'K', b'\x04', b'9', b'\x04', b'\x00', b'\x00')

# ВЫВОД.
# Анализ проводился для високосного года.
# В результате анализа работы программы определения високосный год или нет получено, что для каждого варианта Счетчик
# ссылок равен 3, ячейка памяти каждый раз разная. Однозначный вывод о наилучшем варианте программы поможет сделать предыдущее
# домашнее задание, где определялась скорость работы - с учетом полученных ранее и сейчас результатов лучший вариант программы -
# вариант 3.